## Multiple DataFrames

In [1]:
import pandas as pd

In order to efficiently store data, we often spread related information across multiple tables.

For instance, imagine that we own an e-commerce business and we want to track the products that have been ordered from our website.

We could have one table with all of the following information:

order_id
customer_id
customer_name
customer_address
customer_phone_number
product_id
product_description
product_price
quantity
timestamp

However, a lot of this information would be repeated. 

 If the same customer makes multiple orders, that customer’s name, address, and phone number will be reported multiple times. 

 If the same product is ordered by multiple customers, then the product price and description will be repeated. 

This will make our orders table big and unmanageable.

In [ ]:
So instead, we can split our data into three tables:  customers ,  products , orders

where 

customers: contain the information for each customer
           customer_id, customer_name, customer_address, and customer_phone_number

products: contain the information to describe each product
          product_id, product_description and product_price

orders  : contain the information necessary to describe an order
          order_id, customer_id, product_id, quantity, and timestamp

In [2]:
orders = pd.read_csv(r'D:\GIT_Repositories\pandas\multids_orders.csv')

In [3]:
products = pd.read_csv(r'D:\GIT_Repositories\pandas\multids_products.csv')

In [4]:
customers = pd.read_csv(r'D:\GIT_Repositories\pandas\multids_customers.csv')

In [5]:
orders.head()

   order_id  customer_id  product_id  quantity   timestamp
0         1            2           3         1  01-01-2017
1         2            2           2         3  01-01-2017
2         3            3           1         1  01-01-2017
3         4            3           2         2  01-02-2017
4         5            3           3         3  01-02-2017

In [6]:
products.head()

   product_id         description  price
0           1      thing-a-ma-jig      5
1           2  whatcha-ma-call-it     10
2           3          doo-hickey      7
3           4               gizmo      3

In [7]:
customers.head()

   customer_id customer_name        address  phone_number
0            1    John Smith   123 Main St.  212-123-4567
1            2      Jane Doe  456 Park Ave.  949-867-5309
2            3     Joe Schmo   798 Broadway  112-358-1321

## Question

Given a single table, how can we split it into multiple tables?

In [ ]:
In this context, the tables are dataframes. 

Because they are dataframes, we just need to split the dataframe into separate CSV files using methods from Pandas.

Example: 
========
To split a dataframe (“table”) into separate dataframes (“tables”), and save them into separate CSV files, 
to make them more manageable to work with.

# First, read the original CSV and store in 
# a variable. This is the original "table".
data = pd.read_csv("filename.csv")

# Split the dataframe into separate ones, by columns.
# These are the "tables".
df1 = data[['col1', 'col2']]
df2 = data[['col3', 'col4', 'col5']]
df3 = data[['col6', 'col7', 'col8']]

# Now, we just need to store these into # their own CSV files.
# Note: index=False is used to remove the added index column.
df1.to_csv('table1.csv', index=False)
df2.to_csv('table2.csv', index=False)
df3.to_csv('table3.csv', index=False)

## Inner Merge I

In [8]:
orders.head()

   order_id  customer_id  product_id  quantity   timestamp
0         1            2           3         1  01-01-2017
1         2            2           2         3  01-01-2017
2         3            3           1         1  01-01-2017
3         4            3           2         2  01-02-2017
4         5            3           3         3  01-02-2017

In [9]:
customers.head()

   customer_id customer_name        address  phone_number
0            1    John Smith   123 Main St.  212-123-4567
1            2      Jane Doe  456 Park Ave.  949-867-5309
2            3     Joe Schmo   798 Broadway  112-358-1321

In [10]:
products.head()

   product_id         description  price
0           1      thing-a-ma-jig      5
1           2  whatcha-ma-call-it     10
2           3          doo-hickey      7
3           4               gizmo      3

In [ ]:
If we just look at the orders table, we can’t really tell what’s happened in each order. 

However, if we refer to the other tables, we can get a more complete picture.

In [ ]:
Let’s examine the order with an order_id of 1. It was purchased by Customer 2. 

To find out the customer’s name, we look at the customers table and look for the item with a customer_id value of 2. 

We can see that Customer 2’s name is Jane Doe and that she lives at 456 Park Ave.

Doing this kind of matching is called merging two DataFrames.

## Question

is it possible for there to be duplicate values in the id column of a dataframe?

In [ ]:
Yes, unlike SQL which has primary keys, there is no equivalent method for a column in a pandas dataframe. 

As a result, a column such as order_id in the orders table can potentially have duplicate values.

However, there are a few ways you might deal with this.

Approach 1. drop just the duplicate values of a specific column such that you only have unique values. Like so
==========
    
df.drop_duplicates(subset=['column_name'])

Approach 2: reset the indexes for each row, and possibly use that as a unique identifier, using reset_index(). 
==========

This method resets the values of the index column to start from 0 and incrementing by 1 for each row, and 
each one can be guaranteed to be unique.

## .merge()

In [ ]:
method looks for columns that are common between two DataFrames and 

then looks for rows where those column’s values are the same. 

It then combines the matching rows into a single row in a new table.

In [ ]:
Example/Syntax: pd.merge() method with two tables

new_df = pd.merge(orders, customers)

This will match up all of the customer information to the orders that each customer made.

## Task 1

In [ ]:
You are an analyst at Cool T-Shirts Inc. You are going to help them analyze some of their sales data.

There are two DataFrames defined 

1. sales:  contains the monthly revenue for Cool T-Shirts Inc. 
It has two columns: month and revenue.

2. targets: contains the goals for monthly revenue for each month. 
It has two columns: month and target.

Create a new DataFrame sales_vs_targets which contains the merge of sales and targets.

In [11]:
sales = pd.read_csv(r'D:\GIT_Repositories\pandas\T-Shirts_sales.csv')

In [12]:
targets = pd.read_csv(r'D:\GIT_Repositories\pandas\T-Shirts_targets.csv')

In [13]:
sales

      month  revenue
0   January      300
1  February      290
2     March      310
3     April      325
4       May      475
5      June      495

In [14]:
targets

      month  target
0   January     310
1  February     270
2     March     300
3     April     350
4       May     475
5      June     500

In [15]:
sales_vs_targets = pd.merge(sales, targets)

In [16]:
sales_vs_targets

      month  revenue  target
0   January      300     310
1  February      290     270
2     March      310     300
3     April      325     350
4       May      475     475
5      June      495     500

## Task

In [ ]:
Cool T-Shirts Inc. wants to know the months when they crushed their targets.

Select the rows from sales_vs_targets where revenue is greater than target. Save these rows to the variable crushing_it.

In [18]:
crushing_it = sales_vs_targets[sales_vs_targets['revenue'] > sales_vs_targets['target']]

In [19]:
crushing_it

      month  revenue  target
1  February      290     270
2     March      310     300

## Question

In [ ]:
if two dataframes share more than one column name, how are they merged? 

Are they just merged on the first matching column, or every matching column?

In [ ]:
The merge will check all columns that match between the two dataframes if they share more than one column name.

By default, if we run the pd.merge() method, it performs an inner join. 
With an inner join, all values of every matching column must match in order for the rows to be returned.

In the following example, only the rows for which all values of every matching column are the same will be returned.

df1 = pd.DataFrame({
  'id': [1, 2, 3],
  'name': ['Alice', 'Bob', 'Carl']
})

df2 = pd.DataFrame({
  'id': [1, 2, 3],
  'name': ['David', 'Elsa', 'Carl']
})

merged = pd.merge(df1, df2)
print(merged)
#       id    name
#  0     3    Carl

## Inner Merge II

In [ ]:
In addition to using pd.merge(), each DataFrame has its own .merge() method. 

For instance, if you wanted to merge orders with customers, you could use:

new_df = orders.merge(customers)

This produces the same DataFrame as if we had called pd.merge(orders, customers).

#### when do we prefer the Dataframes own merge method over pd.merge() ????

In [ ]:
We generally use this when we are joining more than two DataFrames together because we can “chain” the commands.

The following command would merge orders to customers, and then the resulting DataFrame to products:

big_df = orders.merge(customers)\
    .merge(products)

## Task

In [ ]:

We have some more data from Cool T-Shirts Inc. 

The number of men’s and women’s t-shirts sold per month is in a file called men_women_sales.csv. 

Load this data into a DataFrame called men_women.

Merge all three DataFrames (sales, targets, and men_women) into one big DataFrame called all_data.

Display all_data using print.

In [20]:
men_women = pd.read_csv(r'T-Shirts_men_women_sales.csv')

In [23]:
men_women

      month  men  women
0   January   30     35
1  February   29     35
2     March   31     29
3     April   32     28
4       May   47     50
5      June   49     45

In [21]:
all_data = sales \
    .merge(targets) \
    .merge(men_women)

In [22]:
all_data

      month  revenue  target  men  women
0   January      300     310   30     35
1  February      290     270   29     35
2     March      310     300   31     29
3     April      325     350   32     28
4       May      475     475   47     50
5      June      495     500   49     45

## Task

In [ ]:
Cool T-Shirts Inc. thinks that they have more revenue in months where they sell more women’s t-shirts.

Select the rows of all_data where:

revenue is greater than target
AND

women is greater than men

Save your answer to the variable results.

In [25]:
all_data[all_data['revenue'] > all_data['target']]

      month  revenue  target  men  women
1  February      290     270   29     35
2     March      310     300   31     29

In [26]:
all_data[all_data['women'] > all_data['men']]

      month  revenue  target  men  women
0   January      300     310   30     35
1  February      290     270   29     35
4       May      475     475   47     50

In [29]:
results = all_data [ ( all_data['revenue'] > all_data['target'] )  &  \
                     ( all_data['women'] > all_data['men']     )]

In [30]:
results

      month  revenue  target  men  women
1  February      290     270   29     35

In [ ]:
##### check if we have any months where revenue > target but women sales < men sales

In [31]:
results1 = all_data [ ( all_data['revenue'] > all_data['target'] )  &  \
                     ( all_data['women'] < all_data['men']     )]

In [32]:
results1

   month  revenue  target  men  women
2  March      310     300   31     29

#### from above it is evident that below is NOT always true

more revenue in months where they sell more women’s t-shirts.

## Question

does merge order matter for Pandas dataframes?

In [ ]:
Yes. Order of the merged dataframes will effect the order of the rows and columns of the merged dataframe.

When using the merge() method, it will preserve the order of the left keys.

For example,
    
df1.merge(df2).merge(df3)

will preserve the order of df1 when it is merged with df2, then this order will be preserved when finally merging with df3.

However, if order of the result dataframe actually does not matter to us, then the merge order will not matter. So,

df3.merge(df1).merge(df2)

will result in the same result, but in a different order than the previous example.

## Merge on Specific Columns

In [ ]:
In the previous example, the .merge() function “knew” how to combine tables based on the columns that were the same between two tables. 

For instance, products and orders both had a column called product_id.

This won’t always be true when we want to perform a merge.

In [ ]:
Generally, the products and customers DataFrames would not have the columns product_id or customer_id. 

Instead, they would both be called id and it would be implied that the id was the product_id for the products table and customer_id 
for the customers table. 

They would look like this:

Customers
---------

id	customer_name	address	        phone_number
1	John Smith	    123 Main St.	212-123-4567
2	Jane Doe	    456 Park Ave.	949-867-5309
3	Joe Schmo	    798 Broadway	112-358-1321

Products
--------

id	description	        price
1	thing-a-ma-jig	    5
2	whatcha-ma-call-it	10
3	doo-hickey	        7
4	gizmo	            3

### **How would this affect our merges?**

In [ ]:
Because the id columns would mean something different in each table, our default merges would be wrong.

One way that we could address this problem is to use .rename() to rename the columns for our merges.

Example: 

rename the column 'id ' to customer_id, so that orders and customers have a common column for the merge.

pd.merge(
    orders,
    customers.rename(columns={'id': 'customer_id'}))

## Task

In [ ]:
Merge orders and products using .rename(). Save your results to the variable orders_products.

rders_products = pd.merge(
                  orders, 
                  products.rename(columns={'id':'product_id'}))

## Question:

are id columns similar to primary keys in SQL?

In [ ]:
They are similar, but their functionality is not the same as for SQL.

In SQL, primary keys provide a constraint so that the values in a column must be unique. It can throw an error if the values are not unique.

In Pandas however, there are not really any primary key constraints, as values under a column like product_id can 
still have duplicate values.

Instead, when working with dataframes, we would need to designate some column to act as a “primary key”, and 
make sure that any duplicates are removed from or prevented for the column.

## Merge on Specific Columns II

Approch 2: to merge columns with different names but same values ---> left_on and right_on

In [ ]:
In the previous exercise, we learned how to use .rename() to merge two DataFrames whose columns don’t match.

In [ ]:
If we don’t want to do that, we have another option. We could use the keywords left_on and right_on 
to specify which columns we want to perform the merge on.

In [ ]:
Example

the “left” table is the one that comes first (orders), and the “right” table is the one that comes second (customers).

In [ ]:
pd.merge(
    orders,
    customers,
    left_on='customer_id',
    right_on='id')

This syntax says that we should match the customer_id from orders to the id in customers.

In [67]:
orders1 = pd.read_csv(r'multids_orders_1.csv')
customers1 = pd.read_csv(r'multids_customers_1.csv')

In [52]:
orders1

   id  customer_id  product_id  quantity   timestamp
0   1            2           3         1  01-01-2017
1   2            2           2         3  01-01-2017
2   3            3           1         1  01-01-2017
3   4            3           2         2  01-02-2017
4   5            3           3         3  01-02-2017
5   6            1           4         2  01-03-2017
6   7            1           1         1  02-02-2017
7   8            1           4         1  02-02-2017

In [53]:
customers1

   id customer_name        address  phone_number
0   1    John Smith   123 Main St.  212-123-4567
1   2      Jane Doe  456 Park Ave.  949-867-5309
2   3     Joe Schmo   798 Broadway  112-358-1321

In [ ]:
from below we will end up with two columns called id, one from the first table and one from the second. 

Pandas won’t let you have two columns with the same name, so it will change them to id_x and id_y.

In [54]:
pd.merge(
    orders1,
    customers1,
    left_on='customer_id',
    right_on='id')

,id_x,customer_id,product_id,quantity,timestamp,id_y,customer_name,address,phone_number
0,1,2,3,1,01-01-2017,2,Jane Doe,456 Park Ave.,949-867-5309
1,2,2,2,3,01-01-2017,2,Jane Doe,456 Park Ave.,949-867-5309
2,3,3,1,1,01-01-2017,3,Joe Schmo,798 Broadway,112-358-1321
3,4,3,2,2,01-02-2017,3,Joe Schmo,798 Broadway,112-358-1321
4,5,3,3,3,01-02-2017,3,Joe Schmo,798 Broadway,112-358-1321
5,6,1,4,2,01-03-2017,1,John Smith,123 Main St.,212-123-4567
6,7,1,1,1,02-02-2017,1,John Smith,123 Main St.,212-123-4567
7,8,1,4,1,02-02-2017,1,John Smith,123 Main St.,212-123-4567

In [ ]:
The new column names id_x and id_y aren’t very helpful for us when we read the table. 

We can help make them more useful by using the keyword suffixes. 

We can provide a list of suffixes to use instead of “_x” and “_y”.

In [ ]:
Example: we could use the following code to make the suffixes reflect the table names:

In [56]:
pd.merge(
    orders1,
    customers1,
    left_on='customer_id',
    right_on='id',
    suffixes=['_order', '_customer']
)

,id_order,customer_id,product_id,quantity,timestamp,id_customer,customer_name,address,phone_number
0,1,2,3,1,01-01-2017,2,Jane Doe,456 Park Ave.,949-867-5309
1,2,2,2,3,01-01-2017,2,Jane Doe,456 Park Ave.,949-867-5309
2,3,3,1,1,01-01-2017,3,Joe Schmo,798 Broadway,112-358-1321
3,4,3,2,2,01-02-2017,3,Joe Schmo,798 Broadway,112-358-1321
4,5,3,3,3,01-02-2017,3,Joe Schmo,798 Broadway,112-358-1321
5,6,1,4,2,01-03-2017,1,John Smith,123 Main St.,212-123-4567
6,7,1,1,1,02-02-2017,1,John Smith,123 Main St.,212-123-4567
7,8,1,4,1,02-02-2017,1,John Smith,123 Main St.,212-123-4567

## Task

In [ ]:
Merge orders and products using left_on and right_on. Use the suffixes _orders and _products. 

Save your results to the variable orders_products.

In [68]:
products1 = pd.read_csv(r'multids_products_1.csv')

In [63]:
orders_products  = pd.merge(
         orders1,
         products1,
         left_on = 'product_id',
         right_on = 'id',
         suffixes = ['_orders', '_products']
)

In [64]:
orders_products

,id_orders,customer_id,product_id,quantity,timestamp,id_products,description,price
0,1,2,3,1,01-01-2017,3,doo-hickey,7
1,2,2,2,3,01-01-2017,2,whatcha-ma-call-it,10
2,3,3,1,1,01-01-2017,1,thing-a-ma-jig,5
3,4,3,2,2,01-02-2017,2,whatcha-ma-call-it,10
4,5,3,3,3,01-02-2017,3,doo-hickey,7
5,6,1,4,2,01-03-2017,4,gizmo,3
6,7,1,1,1,02-02-2017,1,thing-a-ma-jig,5
7,8,1,4,1,02-02-2017,4,gizmo,3

## Question

In [ ]:
can we merge on more than one specific column ???

In [ ]:
Yes, you can perform a merge on one column, or on multiple specified columns, by passing in a list of the column names for each dataframe.

In [ ]:
When listing multiple column names, it will only return rows for which all the column values match 

Furthermore, the number of columns listed must match, and the order they are listed will matter

In [ ]:
Example

In [ ]:
# This will match the values for 
# column "a" with "c" 
# and column "b" with "d".

pd.merge(
  df1,
  df2,
  left_on=["a", "b"],
  right_on=["c", "d"]
)

## Mismatched Merges

In our previous examples, there were always matching values when we were performing our merges. What happens when that isn’t true?

Let’s imagine that our products table is out of date and is missing the newest product: Product 5. What happens when someone orders it?

i.e. We’ve just released a new product with product_id equal to 5. People are ordering this product, but we haven’t updated the products table.

In [69]:
orders1

   id  customer_id  product_id  quantity   timestamp
0   1            2           3         1  01-01-2017
1   2            2           2         3  01-01-2017
2   3            3           1         1  01-01-2017
3   4            3           2         2  01-02-2017
4   5            3           3         3  01-02-2017
5   6            1           4         2  01-03-2017
6   7            1           1         1  02-02-2017
7   8            1           4         1  02-02-2017
8   9            1           5         1  02-02-2024

In [70]:
products1

   id         description  price
0   1      thing-a-ma-jig      5
1   2  whatcha-ma-call-it     10
2   3          doo-hickey      7
3   4               gizmo      3

In [ ]:
Notice that the 9th order in orders is for the mysterious new product, but that there is no product_id 5 in products.

In [76]:
pd.merge(orders1, 
         products1, 
         left_on='product_id', 
         right_on='id')

,id_x,customer_id,product_id,quantity,timestamp,id_y,description,price
0,1,2,3,1,01-01-2017,3,doo-hickey,7
1,2,2,2,3,01-01-2017,2,whatcha-ma-call-it,10
2,3,3,1,1,01-01-2017,1,thing-a-ma-jig,5
3,4,3,2,2,01-02-2017,2,whatcha-ma-call-it,10
4,5,3,3,3,01-02-2017,3,doo-hickey,7
5,6,1,4,2,01-03-2017,4,gizmo,3
6,7,1,1,1,02-02-2017,1,thing-a-ma-jig,5
7,8,1,4,1,02-02-2017,4,gizmo,3

## Question

what happens when there is a mismatch when performing a merge?

When there is a mismatch for a merge of two dataframes, the rows that have no match will simply not be included in the result dataframe.

#### Note:

By default the pd.merge() method performs an inner merge, which means that it will only return a row 
if there is a matching value in both dataframes.

## Outer Merge

when we merge two DataFrames whose rows don’t match perfectly, we lose the unmatched rows.

This type of merge (where we only include matching rows) is called an inner merge.

There are other types of merges that we can use when we want to keep information from the unmatched rows.

Suppose that two companies, Company A and Company B have just merged. 

They each have a list of customers, but they keep slightly different data. 

Company A has each customer’s name and email. 

Company B has each customer’s name and phone number. 

They have some customers in common, but some are different.

#### company_a

name	        email
Sally Sparrow	sally.sparrow@gmail.com
Peter Grant	    pgrant@yahoo.com
Leslie May	    leslie_may@gmail.com

#### company_b

name	      phone
Peter Grant	  212-345-6789
Leslie May	  626-987-6543
Aaron Burr	  303-456-7891

In [ ]:
If we wanted to combine the data from both companies without losing the customers who are missing from one of the tables, 
we could use an Outer Join.

#### Outer Join

In [ ]:
An Outer Join would include all rows from both tables, even if they don’t match. 

Any missing values are filled in with None or nan (which stands for “Not a Number”).

In [ ]:
pd.merge(company_a, company_b, how='outer')

The resulting table would look like this:

name	        email	                      phone
Sally Sparrow	sally.sparrow@gmail.com	      nan
Peter Grant  	pgrant@yahoo.com	          212-345-6789
Leslie May	    leslie_may@gmail.com	      626-987-6543
Aaron Burr	    nan	                          303-456-7891

## Task

There are two hardware stores in town: Store A & Store B. 

Store A’s inventory is in DataFrame store_a and 
Store B’s inventory is in DataFrame store_b. 

They have decided to merge into one big Super Store!

Combine the inventories of Store A and Store B using an outer merge. Save the results to the variable store_a_b_outer.

In [77]:
store_a = pd.read_csv(r'store_a.csv')
store_b = pd.read_csv(r'store_b.csv')

In [78]:
store_a

          item  store_a_inventory
0       hammer                 12
1  screwdriver                 15
2        nails                200
3       screws                350
4          saw                  6
5    duct tape                150
6       wrench                 12
7     pvc pipe                 54

In [79]:
store_b

            item  store_b_inventory
0         hammer                  6
1          nails                250
2            saw                  6
3      duct tape                150
4       pvc pipe                 54
5           rake                 10
6         shovel                 15
7  wooden dowels                192

In [81]:
store_a_b_outer = pd.merge(store_a,
                           store_b,
                           how = 'outer')

In [82]:
store_a_b_outer

             item  store_a_inventory  store_b_inventory
0       duct tape              150.0              150.0
1          hammer               12.0                6.0
2           nails              200.0              250.0
3        pvc pipe               54.0               54.0
4            rake                NaN               10.0
5             saw                6.0                6.0
6     screwdriver               15.0                NaN
7          screws              350.0                NaN
8          shovel                NaN               15.0
9   wooden dowels                NaN              192.0
10         wrench               12.0                NaN

## Question

can we set another value to take place of missing values instead of None or nan?

After performing an outer merge, missing values will become filled with None or nan by default, 
and there is no way to set another value during this step.

In [ ]:
After the merge, replacing these is a bit easier

In [ ]:
You can utilize the fillna() method, which will replace all missing or nan values with another value you specify.

#### fillna()

In [ ]:
# Replaces all nan values with 0
df.fillna(0, inplace=True)

# Left and Right Merge

### Left Merge

A Left Merge includes all rows from the first (left) table, but only rows from the second (right) table that match the first table.

Suppose we want to identify which customers are missing phone information.

We would want a list of all customers who have email, but don’t have phone.

We could get this by performing a Left Merge

For this command, the order of the arguments matters.

pd.merge(company_a, company_b, how='left')

By listing company_a first, we get all customers from Company A, and only customers from Company B who are also customers of Company A.

In [84]:
company_a = pd.read_csv(r'company_a.csv')
company_b = pd.read_csv(r'company_b.csv')

In [85]:
company_a

            name                     email
0  Sally Sparrow   sally.sparrow@gmail.com
1    Peter Grant          pgrant@yahoo.com
2     Leslie May      leslie_may@gmail.com

In [86]:
company_b

          name           phone
0  Peter Grant    212-345-6789
1   Leslie May    626-987-6543
2   Aaron Burr    303-456-7891

In [87]:
pd.merge(company_a, company_b, how='left')

            name                     email           phone
0  Sally Sparrow   sally.sparrow@gmail.com             NaN
1    Peter Grant          pgrant@yahoo.com    212-345-6789
2     Leslie May      leslie_may@gmail.com    626-987-6543

## Right Merge

exact opposite of left merge

Here, the merged table will include all rows from the second (right) table, but only rows from the first (left) table that match the second table.

Example

By listing company_a first and company_b second, we get all customers from Company B, and 
only customers from Company A who are also customers of Company B.

In [88]:
pd.merge(company_a, company_b, how="right")

          name                     email           phone
0  Peter Grant          pgrant@yahoo.com    212-345-6789
1   Leslie May      leslie_may@gmail.com    626-987-6543
2   Aaron Burr                       NaN    303-456-7891

## Task

In [ ]:
Let’s return to the two hardware stores, Store A and Store B. 

They’re not quite sure if they want to merge into a big Super Store just yet.

Store A wants to find out what products they carry that Store B does not carry. 
Using a left merge, combine store_a to store_b and save the results to store_a_b_left.

The items with null in store_b_inventory are carried by Store A, but not Store B.

In [91]:
store_a

          item  store_a_inventory
0       hammer                 12
1  screwdriver                 15
2        nails                200
3       screws                350
4          saw                  6
5    duct tape                150
6       wrench                 12
7     pvc pipe                 54

In [93]:
store_b

            item  store_b_inventory
0         hammer                  6
1          nails                250
2            saw                  6
3      duct tape                150
4       pvc pipe                 54
5           rake                 10
6         shovel                 15
7  wooden dowels                192

In [89]:
store_a_b_left = pd.merge(store_a,
                          store_b,
                          how = 'left')

In [90]:
store_a_b_left

          item  store_a_inventory  store_b_inventory
0       hammer                 12                6.0
1  screwdriver                 15                NaN
2        nails                200              250.0
3       screws                350                NaN
4          saw                  6                6.0
5    duct tape                150              150.0
6       wrench                 12                NaN
7     pvc pipe                 54               54.0

Now, Store B wants to find out what products they carry that Store A does not carry.

In [ ]:
Use a left join, to combine the two DataFrames but in the reverse order (i.e., store_b followed by store_a) and 
save the results to the variable store_b_a_left.

In [94]:
store_b_a_left = pd.merge(store_b,
                          store_a,
                          how = 'left')

In [95]:
store_b_a_left

            item  store_b_inventory  store_a_inventory
0         hammer                  6               12.0
1          nails                250              200.0
2            saw                  6                6.0
3      duct tape                150              150.0
4       pvc pipe                 54               54.0
5           rake                 10                NaN
6         shovel                 15                NaN
7  wooden dowels                192                NaN

## Question

is a left merge just a right merge but switching the order of the dataframes?

Yes, a left merge is the reverse of a right merge, and you can essentially perform either by switching the order of dataframes 
and using the other type of merge.

For example, these will produce the same results.
    
df1.merge(df2, how='left')

    and

df2.merge(df1, how='right')

The only difference would be the order of the resulting dataframe, for the columns and 
for the rows which will preserve the order of the left keys.

## Concatenate DataFrames

Sometimes, a dataset is broken into multiple tables. 

For instance, data is often split into multiple CSV files so that each download is smaller.

to reconstruct a single DataFrame from multiple smaller DataFrames ---

pd.concat([df1, df2, df3, ...]).

#### Note: This method only works if all of the columns are the same in all of the DataFrames.

For instance, suppose that we have two DataFrames:

df1
===
name	        email
Katja Obinger	k.obinger@gmail.com
Alison Hendrix	alisonH@yahoo.com
Cosima Niehaus	cosi.niehaus@gmail.com
Rachel Duncan	rachelduncan@hotmail.com

df2
===
name	        email
Jean Gray	    jgray@netscape.net
Scott Summers	ssummers@gmail.com
Kitty Pryde	    kitkat@gmail.com
Charles Xavier	cxavier@hotmail.com

If we want to combine these two DataFrames, we can use the following command:

pd.concat([df1, df2])

Result:
=======

name	        email
Katja Obinger	k.obinger@gmail.com
Alison Hendrix	alisonH@yahoo.com
Cosima Niehaus	cosi.niehaus@gmail.com
Rachel Duncan	rachelduncan@hotmail.com
Jean Gray	    jgray@netscape.net
Scott Summers	ssummers@gmail.com
Kitty Pryde	    kitkat@gmail.com
Charles Xavier	cxavier@hotmail.com

## Task

An ice cream parlor and a bakery have decided to merge.

The bakery’s menu is stored in the DataFrame bakery, and the ice cream parlor’s menu is stored in DataFrame ice_cream.

Create their new menu by concatenating the two DataFrames into a DataFrame called menu.

In [96]:
ice_cream = pd.read_csv(r'ice_cream.csv')
bakery = pd.read_csv(r'bakery.csv')

In [97]:
ice_cream

                              item  price
0     scoop of chocolate ice cream   3.00
1       scoop of vanilla ice cream   2.95
2    scoop of strawberry ice cream   3.05
3  scoop of cookie dough ice cream   3.25

In [98]:
bakery

                  item  price
0               cookie   2.50
1              brownie   3.50
2        slice of cake   4.75
3  slice of cheesecake   4.75
4         slice of pie   5.00

In [104]:
menu = pd.concat([ice_cream, bakery])

In [105]:
menu

                              item  price
0     scoop of chocolate ice cream   3.00
1       scoop of vanilla ice cream   2.95
2    scoop of strawberry ice cream   3.05
3  scoop of cookie dough ice cream   3.25
0                           cookie   2.50
1                          brownie   3.50
2                    slice of cake   4.75
3              slice of cheesecake   4.75
4                     slice of pie   5.00

## Question

does concatenating dataframes preserve row order?

In [ ]:
Yes, by default, concatenating dataframes will preserve their row order. 

The order of the dataframes to concatenate will be the order of the result dataframe.

One way to think of the concat method is that it just stacks a dataframe on top of another dataframe.

For example,
pd.concat([df1, df2, df3])

will result in a dataframe with the rows of df1 stacked on top of the rows of df2, 
which will be stacked on top of the rows in df3, preserving their initial row order.

#### Note

In [ ]:
by default, duplicate rows will be included when concatenating dataframes. So,

pd.concat([df1, df1])

will result in having the dataframe df1 on top of itself with all rows duplicated.